const MATERIALS = {
  "tier": [
    {
      "type": {
        "0": { "name": "野獸之爪" },
        "1": { "name": "鐵錠" },
        "2": { "name": "純淨水" },
        "3": { "name": "史萊姆殘液" },
        "4": { "name": "毒之粉" }
      }
    }, {
      "type": {
        "0": { "name": "巨獸之爪" },
        "1": { "name": "鍛鐵錠" },
        "2": { "name": "月光水" },
        "3": { "name": "高級合劑" },
        "4": { "name": "星之粉" }
      }
    }, {
      "type": {
        "0": { "name": "惡魔之爪" },
        "1": { "name": "純源鋼錠" },
        "2": { "name": "精靈露水" },
        "3": { "name": "彩虹合劑" },
        "4": { "name": "暗之粉" }
      }
    }, {
      "type": {
        "5": { "name": "堅固之角" },
        "6": { "name": "銀錠" },
        "7": { "name": "儀式之油" },
        "8": { "name": "腐蝕之塵" },
        "9": { "name": "劇毒蛇牙" },
        "10": { "name": "獅鷲之喙" },
        "11": { "name": "熊皮" },
        "12": { "name": "邪語之書" },
        "13": { "name": "精緻尾羽" },
        "14": { "name": "蟲巢之絲" }
      }
    }, {
      "type": {
        "5": { "name": "狂牛之角" },
        "6": { "name": "聖銀錠" },
        "7": { "name": "聖油" },
        "8": { "name": "暗龍結晶" },
        "9": { "name": "邪龍毒牙" },
        "10": { "name": "聖鷲之喙" },
        "11": { "name": "巨鹿毛皮" },
        "12": { "name": "墮天之書" },
        "13": { "name": "女妖尾羽" },
        "14": { "name": "蛛后之絲" }
      }
    }, {
      "type": {
        "998": { "name": "技之碎片" },
        "999": { "name": "技之原石" }
      }
    }
  ]
}